// © Copyright 2004-2012, 2015 HP Development Company, L.P.

TaskName = "Restrict Color";

ApplyButton = "Apply Now";
NewButton = "New…";
DeleteButton = "Delete";
AddButton = "Add";
CancelButton = "Cancel";

// Restrict Color Use
RestrictColorUseTabName = "Restrict Color Use";
RestrictColorUseTabDescription = "This feature is used to restrict color printing for all users, or for specific users and/or applications. For example, to print all e‑mail messages without color, select \"Color If Allowed\", then set the e‑mail application's permission to \"Black only\".

Please note that the settings on the other two tabs will only take effect if \"Color If Allowed\" is selected.";

RestrictColorUseTabWithoutUsersDescription = "This feature is used to restrict color printing for all or for specific applications and/or for all or specific groups and users. For example, to print all e-mail messages without color, select \"Color If Allowed\", then set the e-mail application's permission to \"Black only\".

To restrict color printing for all or specific groups and users, select User Roles Management plugin on Task Selection panel.

Please, note that the settings on the other tab and User Roles Management plugin will only take effect if \"Color if Allowed\" is selected.";

RestrictColorUseTabWithoutUsersAndWithoutURMDescription = "This feature is used to restrict color printing for all or for specific applications. For example, to print all e-mail messages without color, select \"Color If Allowed\", then set the e-mail application's permission to \"Black only\".

Please, note that the settings on the other tab will only take effect if \"Color if Allowed\" is selected.";

RestrictColorUseTabWithEWSDescription = "This feature is used to restrict color printing for all users, or for specific users and/or applications. For example, to print all e‑mail messages without color, select \"Color If Allowed\", then set the e‑mail application's permission to \"Black only\".

You can manage the application permissions on the other tab, and permissions for users/groups via the <a>printer's web page</a>

Please, note that those permissions will only take effect if \"Color if Allowed\" is selected.";

RestrictColorUseOptionsPrompt = "Set the color job printing behavior:";
RestrictColorUseEnableColorOptionName = "Enable Color";
RestrictColorUseEnableColorOptionDescription = "All color jobs will be printed in color.";
RestrictColorUseColorIfAllowedOptionName = "Color If Allowed";
RestrictColorUseColorIfAllowedOptionDescription = "The User and Application permissions will determine whether each job will be printed in color or not.";
RestrictColorUseColorIfAllowedOptionWithoutUserDescription = "The Application permissions will determine whether each job will be printed in color or not.";
RestrictColorUseDisableColorOptionName = "Disable Color";
RestrictColorUseDisableColorOptionDescription = "All color jobs will be printed in black.";
RestrictColorForApplications = "Restrict color printing for some computer applications";
RestrictColorForUsers = "Restrict color by user or group permissions";

// User Color Permissions
UserColorPermissionsTabName = "User";
UserColorPermissionsTitle = "User Color Permissions";
UserColorPermissionsTableDescription = "This list stores up to 50 users and their color permissions.";
UserColorPermissionsTableUserNameColumn = "User Name";
UserColorPermissionsTablePermissionColumn = "Permission";
DefaultUserPermissionsTitle = "Default User Permissions:";
BlackOnly = "Black Only";
Color = "Color";
UserColorPermissionsTabDescription = "You may print the Color Usage Job Log to see the names of the users that have printed to this device.";
UserNameTitle = "User Name:";
PermissionTitle = "Permission:";

// Application Color Permissions
AppColorPermissionsTabName = "Application";
AppColorPermissionsTitle = "Application Color Permissions";
App10ColorPermissionsTableDescription = "This list stores up to 10 applications and their color permissions.";
AppColorPermissionsTableDescription = "This list stores applications and their color permissions.";
AppColorPermissionsTableAppNameColumn = "Application Name";
AppColorPermissionsTablePermissionColumn = "Permission";
DefaultAppPermissionsTitle = "Default Application Permissions:";
AppColorPermissionsTabDescription = "You may print the Color Usage Job Log to see the names of the applications that have printed to this device.";
AppNameTitle = "Application Name:";
